# St7GetTotalLoadPathTemplates

Returns the total number and highest ID number of the load path templates in the specified model.

long St7GetTotalLoadPathTemplates(long uID, long* NumTemplates,

long* LastTemplate)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumTemplates

The number of load path templates.

LastTemplate

The highest load path template ID.